/*

Модель системы управления с подавлением гармонических колебаний по каналу возмущения.
ПИД- регулятор в чистом виде не может компенсировать гармонические колебания по каналу возмущения.

ADRC = Active Disturbance Rejection Controll
Активное управление подавлением возмущений.
https://en.wikipedia.org/wiki/Active_disturbance_rejection_control?ysclid=mq552mjdq272501348
В вики модель другая.
TODO Разобраться в чем разница.

------------------------------------------------------

Plant (объект управления).
damping = 0.4
frequency = 7
Plant(s) = (frequency^2) / ( s^2 + 2*damping*frequency*s + frequency^2 )

                   49
Plant(s) = ------------------
            s^2 + 5.6*s + 49

------------------------------------------------------

PID controller (настраивается на объект управления).
P=9.3
I=22.5
D=0.9
N=96.7
              I         N
PID(s) = P + --- + D*-------
              s       1+N/s

Ts = 0.001s Time_stop = 10s

------------------------------------------------------

LPF (фильтр низких частот)
damping = 0.8
frequency = 180
LPF(s) = (frequency^2) / ( s^2 + 2*damping*frequency*s + frequency^2 )

                 32400
LPF(s) = ---------------------
          s^2 + 288*s + 32400

------------------------------------------------------

Передаточная функция компенсатора колебаний по каналу возмущения.
W(s) = LPF(s) * inv(Plant(s))

               32400           s^2 + 5.6*s + 49
W(s) = --------------------- * ------------------
        s^2 + 288*s + 32400          49

        32400*s^2 + 181440*s + 1587600
W(s) = ------------------------------------
        49*s^2 + 14112*s + 1587600

------------------------------------------------------

Ошибка регулирования.
+----+   +--+   +----+
| SP |->-|+ |->-| ER |
+----+   |  |   +----+
         |  |
+----+   |  |
| PV |->-|- |
+----+   +--+

ПИД- регулятор с вычитанием сигнала компенсации колебаний по каналу возмущения.
+----+   +-----+   +--+   +----+
| ER |->-| PID |->-|+ |->-| MW |
+----+   +-----+   |  |   +----+
                   |  |
 +-------------+   |  |
 | COMPENSATOR |->-|- |
 +-------------+   +--+

Модель объекта управления с синусоидальной помехой по каналу возмущения.
          +----+   +--+   +----------+   +----+
          | MW |->-|+ |->-| Plant(s) |->-| PV |
          +----+   |  |   +----------+   +----+
                   |  |
 +-------------+   |  |
 | NOISE 0.6Hz |->-|+ |
 +-------------+   +--+

Сигнал компенсации колебаний по каналу возмущения.

+----+   +--------+   +--+   +-------------+
| MV |->-| LPF(s) |->-|- |->-| COMPENSATOR |
+----+   +--------+   |  |   +-------------+
                      |  |
+----+   +--------+   |  |
| PV |->-|  W(s)  |->-|+ |
+----+   +--------+   +--+

------------------------------------------------------
TODO Реализовать LPF(s) и W(s)
Вариант 1: s == p == d/dt
Вариант 2: Декомпозировать передаточные функции на интеграторы 1/s
Потом залить две модельки на стмку с компенсатором и без компенсатора.
------------------------------------------------------

*/